tests/stress/jmeter/load/deposit.load.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Deposit — Load (stepped capacity verification)" enabled="true">
      <stringProp name="TestPlan.comments">Load test: verify the capacity BOUNDARY discovered by the deposit stress
test holds under sustained load — not just a 30s rolling window.

  BOUNDARY      = 9 VUs    (last fully clean step in the deposit stress
                            run; errors first appeared at 10 VUs)
  70% BOUNDARY  = 6 VUs    (rounded down; conservative warm-up / recovery)

This is a HYBRID load test — a stepped capacity scan with recovery — not a
single-level steady-state load test. Each step holds long enough to expose
slow degradation (connection accumulation, pool starvation, memory creep).

Virtual users are spread across MANY distinct accounts (tests/stress/data/accounts.csv,
1000 rows) via CSVDataSet round-robin (shareMode.all + recycle), so the
per-row FOR UPDATE lock is NOT the bottleneck. We're measuring the system,
not single-account contention.

Shape (Ultimate Thread Group, 28 min total):

  ┌──────────┬──────┬───────┬────────────────────────────────────┐
  │ Window   │ VUs  │ Hold  │ Maps to spec                       │
  ├──────────┼──────┼───────┼────────────────────────────────────┤
  │ 0–5 min  │   6  │  5 m  │ 70% of boundary       (warm-up)    │
  │ 5–10 min │   8  │  5 m  │ boundary - 1 VU       (just under) │
  │ 10–20 m  │   9  │ 10 m  │ boundary              (at boundary)│
  │ 20–25 m  │  10  │  5 m  │ boundary + 1 VU       (just over)  │
  │ 25–28 m  │   6  │  3 m  │ 70% of boundary       (recovery)   │
  └──────────┴──────┴───────┴────────────────────────────────────┘

Pass criteria per phase (same gates as stress):
  - p95 latency &lt; 5000ms
  - error rate &lt; 1%

Expected results:
  - 70% / boundary-1 / boundary  → clean (9 VUs was the last fully clean
                                   step in the deposit stress run; holding
                                   it for 10 min confirms it's sustainable,
                                   not just a lucky 30s window)
  - boundary+1 (10 VUs)          → first errors expected (deposit stress
                                   run saw errors starting at 10 VUs)
  - recovery                     → answers: does the Prisma pool drain and
                                   latency settle, or does the system stay
                                   degraded after a brief overshoot?

Response Assertion: assume_success=true — a 422 (legitimate business
rejection like ACCOUNT_NOT_ACTIVE) is a *successful* request from a
load-test perspective. Only timeouts, 5xx, and unexpected 4xx count as
errors. This differs from the stress test, which left assume_success=false.

Think time: a Gaussian Random Timer is attached to the sampler (mean
3000ms, deviation 1000ms — total delay ≈ 3000ms + |N(0, 1000)| per
iteration). This models realistic user pacing: a customer fills a form,
clicks submit, reads the result, then continues. Without it each VU
would loop as fast as the server replies (~50 req/s/VU), which is a
saturation pattern, not a load pattern.

Consequence for VU counts: the boundary VU numbers above (9 = last
clean step in the deposit stress run) were measured *without* think
time, when each VU contributed ~50 req/s. With the timer, each VU now
contributes ~0.3 req/s. So this load run no longer reproduces the
stress-run throughput at the same VU count — it measures whether the
system stays healthy under sustained *realistic* concurrency. The
P2028 transaction-timeout signature seen at saturation may not appear
here at all, because the Prisma pool now has room to drain between
requests.

Run headless from PROJECT ROOT:
  jmeter -n -t tests/stress/jmeter/load/deposit.load.jmx \
         -l tests/stress/reports/deposit-load.jtl \
         -e -o tests/stress/reports/deposit-load-html

Or via the wrapper script:
  npm run test:load:deposit

Prereqs:
  1. npx tsx tests/stress/scripts/seed.ts
  2. Server running on localhost:3000 (npm run build &amp;&amp; npm start)
  3. JMeter Plugin: jpgc-casutg (Custom Thread Groups)</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_URL" elementType="Argument">
            <stringProp name="Argument.name">BASE_URL</stringProp>
            <stringProp name="Argument.value">${__P(host,localhost)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PORT" elementType="Argument">
            <stringProp name="Argument.name">PORT</stringProp>
            <stringProp name="Argument.value">${__P(port,3000)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="DATA_DIR" elementType="Argument">
            <stringProp name="Argument.name">DATA_DIR</stringProp>
            <stringProp name="Argument.value">${__P(dataDir,tests/stress/data)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults">
        <intProp name="HTTPSampler.connect_timeout">5000</intProp>
        <intProp name="HTTPSampler.response_timeout">15000</intProp>
        <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
        <stringProp name="HTTPSampler.port">${PORT}</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
      </ConfigTestElement>
      <hashTree/>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Authorization</stringProp>
            <stringProp name="Header.value">Bearer ${token}</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="accounts.csv">
        <stringProp name="filename">${DATA_DIR}/accounts.csv</stringProp>
        <stringProp name="fileEncoding">UTF-8</stringProp>
        <stringProp name="variableNames">accountId,userId,token</stringProp>
        <stringProp name="delimiter">,</stringProp>
        <boolProp name="quotedData">false</boolProp>
        <boolProp name="recycle">true</boolProp>
        <boolProp name="stopThread">false</boolProp>
        <stringProp name="shareMode">shareMode.all</stringProp>
        <boolProp name="ignoreFirstLine">true</boolProp>
      </CSVDataSet>
      <hashTree/>
      <kg.apc.jmeter.threads.UltimateThreadGroup guiclass="kg.apc.jmeter.threads.UltimateThreadGroupGui" testclass="kg.apc.jmeter.threads.UltimateThreadGroup" testname="Ultimate Thread Group — 6 → 8 → 9 → 10 → 6 (28 min)">
        <collectionProp name="ultimatethreadgroupdata">
          <collectionProp name="row-baseline-6">
            <stringProp name="utg-r1-threads">6</stringProp>
            <stringProp name="utg-r1-delay">0</stringProp>
            <stringProp name="utg-r1-startup">10</stringProp>
            <stringProp name="utg-r1-hold">1670</stringProp>
            <stringProp name="utg-r1-shutdown">10</stringProp>
          </collectionProp>
          <collectionProp name="row-step-8">
            <stringProp name="utg-r2-threads">2</stringProp>
            <stringProp name="utg-r2-delay">300</stringProp>
            <stringProp name="utg-r2-startup">5</stringProp>
            <stringProp name="utg-r2-hold">295</stringProp>
            <stringProp name="utg-r2-shutdown">0</stringProp>
          </collectionProp>
          <collectionProp name="row-step-9">
            <stringProp name="utg-r3-threads">3</stringProp>
            <stringProp name="utg-r3-delay">600</stringProp>
            <stringProp name="utg-r3-startup">1</stringProp>
            <stringProp name="utg-r3-hold">599</stringProp>
            <stringProp name="utg-r3-shutdown">0</stringProp>
          </collectionProp>
          <collectionProp name="row-step-10">
            <stringProp name="utg-r4-threads">4</stringProp>
            <stringProp name="utg-r4-delay">1200</stringProp>
            <stringProp name="utg-r4-startup">1</stringProp>
            <stringProp name="utg-r4-hold">299</stringProp>
            <stringProp name="utg-r4-shutdown">0</stringProp>
          </collectionProp>
        </collectionProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      </kg.apc.jmeter.threads.UltimateThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/v1/transactions/deposit">
          <stringProp name="HTTPSampler.path">/api/v1/transactions/deposit</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;accountId&quot;:&quot;${accountId}&quot;,&quot;amount&quot;:&quot;0.10&quot;}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <GaussianRandomTimer guiclass="GaussianRandomTimerGui" testclass="GaussianRandomTimer" testname="Think Time — Gaussian (mean 3s, σ 1s)">
            <stringProp name="ConstantTimer.delay">3000</stringProp>
            <stringProp name="RandomTimer.range">1000.0</stringProp>
          </GaussianRandomTimer>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Status is 2xx or 422 (422 = legitimate business rejection)" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1729207179">^(2\d\d|422)$</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Server error or unexpected status — deposit flow broke under load.</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">true</boolProp>
            <intProp name="Assertion.test_type">1</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree (debug only — disable in CLI)" enabled="false">
          <boolProp name="ResultCollector.error_logging">true</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>